SivapriyaDreamer/MCU_Course3/stm32f4xx_drivers/Src/spi_cmd_handling.c
/*
 * spi_cmd_handling.c
 *
 *  Created on: 24-Jun-2023
 *      Author: SivapriyaK
 */

#include "stm32f407xx.h"


//command codes
#define COMMAND_LED_CTRL                   0x50
#define COMMAND_SENSOR_READ				   0x51
#define COMMAND_LED_READ				   0x52
#define COMMAND_PRINT                      0x53
#define COMMAND_ID_READ                    0x54

#define LED_ON  0
#define LED_OFF 1

#define ANALOG_PIN0       0
#define ANALOG_PIN1       1
#define ANALOG_PIN2       2
#define ANALOG_PIN3       3
#define ANALOG_PIN4       4

// arduino led
#define LED_PIN     9

extern void initialise_monitor_handles();

void SPI2_GPIOInits(void)
{
	GPIO_Handle_t SPIPins;

	SPIPins.pGPIOx = GPIOB;
	SPIPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	SPIPins.GPIO_PinConfig.GPIO_PinAltFuncMode = 5;
	SPIPins.GPIO_PinConfig.GPIO_PinOpType = GPIO_OP_TYPE_PP;
	SPIPins.GPIO_PinConfig.GPIO_PinPuPdcontrol = GPIO_NO_PUPD;
	SPIPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	//SCLK
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GPIO_Init(&SPIPins);

	//MOSI
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
	GPIO_Init(&SPIPins);

	//MISO
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
	GPIO_Init(&SPIPins);

	//NSS
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GPIO_Init(&SPIPins);
}

void SPI2_Inits(void)
{
	SPI_Handle_t SPI2Handle;
	SPI2Handle.pSPIx = SPI2;
	SPI2Handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
    SPI2Handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
    SPI2Handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV8; // generates clk of 2 MHz
    SPI2Handle.SPIConfig.SPI_DFF = SPI_DFF_8BITS;
    SPI2Handle.SPIConfig.SPI_CPOL = SPI_CPOL_LOW;
    SPI2Handle.SPIConfig.SPI_CPHA = SPI_CPHA_LOW;
    SPI2Handle.SPIConfig.SPI_SSM = SPI_SSM_DI;  // Hw slave management enabled

    SPI_Init(&SPI2Handle);

}

void delay(void)
{
	for(uint32_t i=0;i<500000/2;i++);
}

void GPIO_Btn_Init(void)
{
	GPIO_Handle_t GpioBtn;
	GpioBtn.pGPIOx = GPIOA;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdcontrol = GPIO_NO_PUPD;



	GPIO_Init(&GpioBtn);
}

uint8_t SPI_verifyresponse(uint8_t ackbyte)
{
	if(ackbyte == 0xf5)
	{
		//ack
		return 1;
	}
	return 0;
}

int main(void)
{
	char user_data[]= "Hello world";

	uint8_t dummy_write = 0xff;
	uint8_t dummy_read;

	initialise_monitor_handles();
	printf("Application is running\n");

	GPIO_Btn_Init();

	SPI2_GPIOInits();

	SPI2_Inits();

	printf("SPI Initialised \n");

	while(1)
	{
	/*
	 * Making SSOE 1 does NSS output enable
	 * The NSS pin is automatically managed by the hardware
	 * i.e. when SPE=1, NSS will be pulled to low
	 * and NSS pin will be high when SPE = 0
	 */
	SPI_SSOEConfig(SPI2,ENABLE);
	//enable the SPE SPI peripheral enable

	//wait till the user button is pressed
	while( !GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));

	delay();

	SPI_PeripheralControl(SPI2,ENABLE);

	//1. CMD_LED_CTRL  <pin no>  <value>
	uint8_t ackbyte;
	uint8_t arg[2];

	uint8_t commandcode = COMMAND_LED_CTRL;
	SPI_SendData(SPI2,&commandcode,1);
	//do dummy read to clear off the Rxne
	SPI_ReceiveData(SPI2, &dummy_read,1);

	//send some dummy bits to fetch the response from the slave
	SPI_SendData(SPI2,&dummy_write,1);
	SPI_ReceiveData(SPI2,&ackbyte,1);

	if(SPI_verifyresponse(ackbyte))
	{
		// send the arguments
		arg[0] = LED_PIN;
		arg[1] = LED_ON;
		SPI_SendData(SPI2,arg,2);
		printf("CMD_LED_CONTROL executed \n");
	}

	//2. CMD_SENSOR_READ   <analog_pin_number()>

	//wait till the user button is pressed
	while( !GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));
	delay();

	commandcode = COMMAND_SENSOR_READ;

	SPI_SendData(SPI2,&commandcode,1);
	//do dummy read to clear off the Rxne
	SPI_ReceiveData(SPI2, &dummy_read,1);

	//send some dummy bits to fetch the response from the slave
	SPI_SendData(SPI2,&dummy_write,1);
	SPI_ReceiveData(SPI2,&ackbyte,1);

	if(SPI_verifyresponse(ackbyte))
	{
	// send the arguments
	arg[0] = ANALOG_PIN0;
	SPI_SendData(SPI2,arg,1);
	SPI_ReceiveData(SPI2, &dummy_read,1);
	delay();
	SPI_SendData(SPI2,&dummy_write,1);
	uint8_t analog_read;
	SPI_ReceiveData(SPI2, &analog_read,1);
	printf("COMMAND_SENSOR_READ %d \n",analog_read);
	}

	//3. CMD_LED_READ <analog pin0()>
	while(!GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));

	delay();

		commandcode = COMMAND_LED_READ;

		SPI_SendData(SPI2,&commandcode,1);
		//do dummy read to clear off the Rxne
		SPI_ReceiveData(SPI2, &dummy_read,1);

		//send some dummy bits to fetch the response from the slave
		SPI_SendData(SPI2,&dummy_write,1);
		SPI_ReceiveData(SPI2,&ackbyte,1);

		if(SPI_verifyresponse(ackbyte))
		{
		// send the arguments
		arg[0] = ANALOG_PIN0;
		SPI_SendData(SPI2,arg,1);
		SPI_ReceiveData(SPI2, &dummy_read,1);
		delay();
		SPI_SendData(SPI2,&dummy_write,1);
		uint8_t led_status;
		SPI_ReceiveData(SPI2, &led_status,1);
		printf("COMMAND_LED_READ %d \n",led_status);
		}

	//4. COMMAND_PRINT <len(2)> <message(len)>
	while( !GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));
		delay();

		commandcode = COMMAND_LED_READ;

		SPI_SendData(SPI2,&commandcode,1);
		//do dummy read to clear off the Rxne
		SPI_ReceiveData(SPI2, &dummy_read,1);

		//send some dummy bits to fetch the response from the slave
		SPI_SendData(SPI2,&dummy_write,1);
		SPI_ReceiveData(SPI2,&ackbyte,1);
		uint8_t message[]= "Hello ! How are you ";
		if(SPI_verifyresponse(ackbyte))
		{
		// send the arguments
		arg[0] = strlen((char*)message);
		SPI_SendData(SPI2,arg,1);
		SPI_SendData(SPI2,message,arg[0]);
		printf("COMMAND_PRINT Executed \n");
		}


	//5. COMMAND_ID_READ <len(2)> <message(len)>
			while( !GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));
				delay();

				commandcode = COMMAND_ID_READ;

				SPI_SendData(SPI2,&commandcode,1);
				//do dummy read to clear off the Rxne
				SPI_ReceiveData(SPI2, &dummy_read,1);

				//send some dummy bits to fetch the response from the slave
				SPI_SendData(SPI2,&dummy_write,1);
				SPI_ReceiveData(SPI2,&ackbyte,1);
				uint8_t id[10];
				uint32_t i=0;

				for(i=0;i<10;i++)
				{
				SPI_SendData(SPI2,&dummy_write,1);
				SPI_ReceiveData(SPI2,&id[i],1);

				}
				id[11]='\0';
				printf("COMMAND_ID_READ = %s\n",id);


	while(SPI_GetFlagStatus(SPI2,SPI_SR_BSY));

	SPI_PeripheralControl(SPI2,DISABLE);

	printf("SPI Communication Closed\n");
	}
	return 0;
}
